In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.__version__

'1.5.3'

In [5]:
None, np.nan

(None, nan)

In [6]:
s = pd.Series([1, 3, 4, np.nan, 6, 8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
type(s)

pandas.core.series.Series

In [8]:
dates = pd.date_range('20130101', periods =6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [10]:
df = pd.DataFrame({'A' : [1, 2, 3],
                  'B' : [1, 2, 3],
                  'C' : [1, 2, 3]})
df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.528197 -1.251824 -2.219473  0.851553
2013-01-02 -1.485320 -0.016745  0.519217 -0.791304
2013-01-03  0.064867  0.801107  0.963199  2.135597
2013-01-04 -0.949195  0.325293  0.179218 -0.461146
2013-01-05 -1.099276  0.304714 -0.494409  0.953546
2013-01-06 -0.241868  1.073610 -0.243649  1.327136

In [13]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [14]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

In [15]:
dane_sprzedaz_df = pd.read_csv('data/dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [16]:
dane_sprzedaz_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 135 entries, 0 to 134
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DZIEN_DATA    135 non-null    object
 1   SKL_ID        135 non-null    int64
 2   TOW_ID        135 non-null    int64
 3   SPRZ_NETTO    133 non-null    float64
 4   ZYSK_PROCENT  135 non-null    int64
 5   ZYSK_WART     135 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 6.5+ KB

In [17]:
dane_sprzedaz_df.describe()

           SKL_ID      TOW_ID  SPRZ_NETTO  ZYSK_PROCENT
count  135.000000  135.000000  133.000000    135.000000
mean     2.000000    2.000000  397.473684      7.659259
std      0.819538    0.819538   54.623724      4.044829
min      1.000000    1.000000  300.000000      1.000000
25%      1.000000    1.000000  356.000000      4.000000
50%      2.000000    2.000000  390.000000      7.000000
75%      3.000000    3.000000  443.000000     11.000000
max      3.000000    3.000000  498.000000     15.000000

In [18]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [19]:
df.head(4)

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486

In [20]:
df.tail()

                   A         B         C         D
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [21]:
df.values

array([[ 0.29624837,  0.24767993, -1.94507042, -0.04270555],
       [ 1.23928478,  0.01187707,  0.33715994,  1.15636634],
       [ 0.61078517,  1.6907807 ,  1.18639178,  0.09963955],
       [ 0.31409175, -1.28680315, -0.25786652,  0.06848553],
       [ 0.71136855, -0.91839524,  0.31362658,  1.07861583],
       [-0.84170833, -0.49276323, -1.32434702,  0.53172171]])

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
import numpy as np
import pandas as pd

my_array = np.array([[11,22,33],[44,55,66]])

df_numpy = pd.DataFrame(my_array, columns = ['Column_A','Column_B','Column_C'])

print(df_numpy)
print(type(df_numpy))

   Column_A  Column_B  Column_C
0        11        22        33
1        44        55        66
<class 'pandas.core.frame.DataFrame'>

In [24]:
data = {
        'col_1': [3, 2, 1, 0], 
        'col_2': ['a', 'b', 'c', 'd']
        }
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [25]:
df

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [26]:
df.shape

(6, 4)

In [27]:
df.size

24

In [28]:
len(df)

6

In [29]:
df.sample(2)

                   A         B         C         D
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-03  0.610785  1.690781  1.186392  0.099640

In [30]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
type(df.A) #chcecking out the type of specific column!

pandas.core.series.Series

In [33]:
df.A #Chcecking out

2013-01-01    0.296248
2013-01-02    1.239285
2013-01-03    0.610785
2013-01-04    0.314092
2013-01-05    0.711369
2013-01-06   -0.841708
Freq: D, Name: A, dtype: float64

In [34]:
df.T #Transposition - changing columns with rows

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.296248    1.239285    0.610785    0.314092    0.711369   -0.841708
B    0.247680    0.011877    1.690781   -1.286803   -0.918395   -0.492763
C   -1.945070    0.337160    1.186392   -0.257867    0.313627   -1.324347
D   -0.042706    1.156366    0.099640    0.068486    1.078616    0.531722

In [35]:
df_sample = df.sample(2)

In [36]:
df.sort_values(by="B", ascending = True)

                   A         B         C         D
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-03  0.610785  1.690781  1.186392  0.099640

In [37]:
df #data frame bez interwencji

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [38]:
df.reset_index(drop=True) #resetowanie indexu w Data Framie

          A         B         C         D
0  0.296248  0.247680 -1.945070 -0.042706
1  1.239285  0.011877  0.337160  1.156366
2  0.610785  1.690781  1.186392  0.099640
3  0.314092 -1.286803 -0.257867  0.068486
4  0.711369 -0.918395  0.313627  1.078616
5 -0.841708 -0.492763 -1.324347  0.531722

In [39]:
df.reset_index(drop=False) #resetowanie indexu w Data Framie

       index         A         B         C         D
0 2013-01-01  0.296248  0.247680 -1.945070 -0.042706
1 2013-01-02  1.239285  0.011877  0.337160  1.156366
2 2013-01-03  0.610785  1.690781  1.186392  0.099640
3 2013-01-04  0.314092 -1.286803 -0.257867  0.068486
4 2013-01-05  0.711369 -0.918395  0.313627  1.078616
5 2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [40]:
df.sum()

A    2.330070
B   -0.747624
C   -1.690106
D    2.892123
dtype: float64

In [41]:
df.min()

A   -0.841708
B   -1.286803
C   -1.945070
D   -0.042706
dtype: float64

In [52]:
df[['A']] #you can also write it as df.A

                   A
2013-01-01  0.296248
2013-01-02  1.239285
2013-01-03  0.610785
2013-01-04  0.314092
2013-01-05  0.711369
2013-01-06 -0.841708

In [53]:
df

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [61]:
df['A'][0] #To chose specific column and row from DataFrame

0.29624837448242947

In [64]:
df[0:3]

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640

In [67]:
df['2013-01-01':'2013-01-03'] #To chose data from specific time out of timestamp row

                   A         B         C         D
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640

In [71]:
b = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

8    0.98
6    0.96
4    0.25
2    0.28
1    0.62
3    0.31
0    1.00
7    0.58
5    0.21
9    0.79
dtype: float64

In [74]:
b.iloc[2] # search by idx

0.25

In [75]:
b.loc[2] # search by name of idx

0.28

In [ ]:
df.loc[2:4] # WRONG! This code has no name and will return ERROR, those columns name does not exist

In [85]:
df.loc[dates[0] : dates[1]] # Index related to date Index < > will be shown.

                   A         B        C         D
2013-01-01  0.296248  0.247680 -1.94507 -0.042706
2013-01-02  1.239285  0.011877  0.33716  1.156366

In [81]:
df.iloc[0:2] # Searchin by index will work

                   A         B        C         D
2013-01-01  0.296248  0.247680 -1.94507 -0.042706
2013-01-02  1.239285  0.011877  0.33716  1.156366

In [100]:
df[-3:5] # REMEMBER - [x, y]  -x goes down y goes up, the result is commont part of those

                   A         B         C         D
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616

In [105]:
df['A'][0]

0.29624837448242947

In [122]:
df.loc[dates[0:2], ['A', 'B']]

                   A         B
2013-01-01  0.296248  0.247680
2013-01-02  1.239285  0.011877

In [140]:
df[ (df.A > 0.5) | (df.B > 0.5) ]

                   A         B         C         D
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-05  0.711369 -0.918395  0.313627  1.078616

In [141]:
df2 = df.copy()

In [152]:
df2.columns = ['E', 'F', 'G', 'H'] # Change the name of Columns

In [154]:
df2.rename(columns={"E": "A"}) # Change the name of Columns, but in other way

                   A         F         G         H
2013-01-01  0.296248  0.247680 -1.945070 -0.042706
2013-01-02  1.239285  0.011877  0.337160  1.156366
2013-01-03  0.610785  1.690781  1.186392  0.099640
2013-01-04  0.314092 -1.286803 -0.257867  0.068486
2013-01-05  0.711369 -0.918395  0.313627  1.078616
2013-01-06 -0.841708 -0.492763 -1.324347  0.531722

In [157]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'pawe']
df2

                E         F         G         H
2013-01-01    one  0.247680 -1.945070 -0.042706
2013-01-02    one  0.011877  0.337160  1.156366
2013-01-03    two  1.690781  1.186392  0.099640
2013-01-04  three -1.286803 -0.257867  0.068486
2013-01-05   four -0.918395  0.313627  1.078616
2013-01-06   pawe -0.492763 -1.324347  0.531722

In [163]:
df2[ (df2.E == 'one') | (df2.E == 'two')]

              E         F         G         H
2013-01-01  one  0.247680 -1.945070 -0.042706
2013-01-02  one  0.011877  0.337160  1.156366
2013-01-03  two  1.690781  1.186392  0.099640

In [164]:
df2[ df2.E.isin(['one', 'two'])]

              E         F         G         H
2013-01-01  one  0.247680 -1.945070 -0.042706
2013-01-02  one  0.011877  0.337160  1.156366
2013-01-03  two  1.690781  1.186392  0.099640

In [168]:
df2[ df2.E.str.contains('o*e', regex=True, na=False)]

                E         F         G         H
2013-01-01    one  0.247680 -1.945070 -0.042706
2013-01-02    one  0.011877  0.337160  1.156366
2013-01-04  three -1.286803 -0.257867  0.068486
2013-01-06   pawe -0.492763 -1.324347  0.531722

Zagrożenie regular expressions
    - Opcja "regex" = True,  włącza możliwość korzystania z funkcjonalnośic Regexów.

In [169]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [172]:
df2['F'] = s1
df2

                E    F         G         H
2013-01-01    one  NaN -1.945070 -0.042706
2013-01-02    one  1.0  0.337160  1.156366
2013-01-03    two  2.0  1.186392  0.099640
2013-01-04  three  3.0 -0.257867  0.068486
2013-01-05   four  4.0  0.313627  1.078616
2013-01-06   pawe  5.0 -1.324347  0.531722

In [173]:
df2['F'] = 5 
df2

                E  F         G         H
2013-01-01    one  5 -1.945070 -0.042706
2013-01-02    one  5  0.337160  1.156366
2013-01-03    two  5  1.186392  0.099640
2013-01-04  three  5 -0.257867  0.068486
2013-01-05   four  5  0.313627  1.078616
2013-01-06   pawe  5 -1.324347  0.531722

In [174]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]

In [175]:
df

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5  NaN  1.0
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  NaN
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  NaN
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  NaN
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  NaN

In [180]:
pd.isna(df) #Check witch columns are N/A

                A      B      C      D      E      F
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True
2013-01-05  False  False  False  False  False   True
2013-01-06  False  False  False  False  False   True

In [183]:
df.isna().any() # Show witch one actually is N/A

A    False
B    False
C    False
D    False
E     True
F     True
dtype: bool

In [184]:
df[ df.isna().any(axis=1) ] # Show only those who have N/A value

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5  NaN  1.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  NaN
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  NaN
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  NaN
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  NaN

In [190]:
df.dropna(how='all') # dropping, where all values for column are N/A

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5  NaN  1.0
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  NaN
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  NaN
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  NaN
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  NaN

In [191]:
df.dropna(how='any') # dropping, where any of the values is N/A

                   A         B         C  D    E    F
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0

In [194]:
df.fillna(5) # fills na Values with given value

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5  5.0  1.0
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  5.0
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  5.0
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  5.0
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  5.0

In [195]:
df.fillna(method='ffill') # fill with the value above

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5  NaN  1.0
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  2.0
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  2.0
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  2.0
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  2.0

In [197]:
df.fillna(method='bfill') # fill with the value bellow

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5 -1.0  1.0
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  NaN
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  NaN
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  NaN
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  NaN

In [199]:
df.fillna(df.mean())

                   A         B         C  D    E    F
2013-01-01 -1.509173 -0.536361  0.671327 -5 -3.0  1.0
2013-01-02  0.032506  0.244605 -0.250819 -5 -1.0  2.0
2013-01-03 -1.239830  0.721339  0.429633 -5 -2.0  1.5
2013-01-04  1.330416  0.102006  0.609999 -5 -3.0  1.5
2013-01-05  0.244631  0.063877 -0.530294 -5 -4.0  1.5
2013-01-06 -0.055579  2.264418  1.144144 -5 -5.0  1.5

In [200]:
df = pd.DataFrame({'DZIEN_ID' : [1,2,3,4,5,6,7],
                   'SPRZEDAZ' : [100,150,300,np.nan,0,200,400],
                   'CENA' : [2.3, 2.2, 1.99, 2.4, np.nan, 2.1, 2.1],
                   'DZIEN_WOLNY' : [0,0,0,0,1,0,0],
                   'MECZ' : [0,0,0,1,0,0,0],
                  })
df

   DZIEN_ID  SPRZEDAZ  CENA  DZIEN_WOLNY  MECZ
0         1     100.0  2.30            0     0
1         2     150.0  2.20            0     0
2         3     300.0  1.99            0     0
3         4       NaN  2.40            0     1
4         5       0.0   NaN            1     0
5         6     200.0  2.10            0     0
6         7     400.0  2.10            0     0

In [204]:
df = pd.DataFrame(np.random.randn(6, 4), #Kod od Mentora 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]
df

                   A         B         C  D    E    F
2013-01-01  1.537251  0.130402 -0.530160 -5  NaN  1.0
2013-01-02  0.171466  0.600683  0.692790 -5 -1.0  2.0
2013-01-03 -0.686669  0.515593  0.232791 -5 -2.0  NaN
2013-01-04  0.501356 -1.317384  0.538449 -5 -3.0  NaN
2013-01-05  1.803684 -1.110519 -0.171500 -5 -4.0  NaN
2013-01-06 -2.560076 -0.501009  1.272388 -5 -5.0  NaN

In [211]:
values = [40, 38, 32.5, 27, 33, 34]
 
df['new_col'] = values

s1 = pd.Series([40.5, 38.5, 33, 28, 26, 25], 
               index=[0, 1, 2, 3, 4, 5])
s2 = pd.Series([48.5, 42, 41, 37, 40, 39], 
               index=[0, 1, 2, 3, 4, 5])
 
df = df.assign(science_score=s1.values, 
                 english_score=s2.values)
df

,A,B,C,D,E,F,new_col,science_score,english_score
2013-01-01,1.537251,0.130402,-0.530160,-5,NaN,1.0,40.0,40.5,48.5
2013-01-02,0.171466,0.600683,0.692790,-5,-1.0,2.0,38.0,38.5,42.0
2013-01-03,-0.686669,0.515593,0.232791,-5,-2.0,NaN,32.5,33.0,41.0
2013-01-04,0.501356,-1.317384,0.538449,-5,-3.0,NaN,27.0,28.0,37.0
2013-01-05,1.803684,-1.110519,-0.171500,-5,-4.0,NaN,33.0,26.0,40.0
2013-01-06,-2.560076,-0.501009,1.272388,-5,-5.0,NaN,34.0,25.0,39.0

In [213]:
df.values # wszystkie wartości danego data frame

array([[ 1.53725077,  0.13040176, -0.53015956, -5.        ,         nan,
         1.        , 40.        , 40.5       , 48.5       ],
       [ 0.17146601,  0.60068324,  0.69279049, -5.        , -1.        ,
         2.        , 38.        , 38.5       , 42.        ],
       [-0.68666919,  0.51559287,  0.23279088, -5.        , -2.        ,
                nan, 32.5       , 33.        , 41.        ],
       [ 0.5013558 , -1.31738358,  0.538449  , -5.        , -3.        ,
                nan, 27.        , 28.        , 37.        ],
       [ 1.80368373, -1.11051886, -0.17149989, -5.        , -4.        ,
                nan, 33.        , 26.        , 40.        ],
       [-2.56007641, -0.50100878,  1.27238794, -5.        , -5.        ,
                nan, 34.        , 25.        , 39.        ]])

In [209]:
df.A.values[0]

1.5372507676237859

In [225]:
df['avg_score'] = df.apply(lambda row: 
                          ((row.new_col + row.science_score + row.english_score) / 3),
                           axis = 1)
df

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,1.537251,0.130402,-0.530160,-5,NaN,1.0,40.0,40.5,48.5,43.000000
2013-01-02,0.171466,0.600683,0.692790,-5,-1.0,2.0,38.0,38.5,42.0,39.500000
2013-01-03,-0.686669,0.515593,0.232791,-5,-2.0,NaN,32.5,33.0,41.0,35.500000
2013-01-04,0.501356,-1.317384,0.538449,-5,-3.0,NaN,27.0,28.0,37.0,30.666667
2013-01-05,1.803684,-1.110519,-0.171500,-5,-4.0,NaN,33.0,26.0,40.0,33.000000
2013-01-06,-2.560076,-0.501009,1.272388,-5,-5.0,NaN,34.0,25.0,39.0,32.666667

In [229]:
df['avg_score'] = df.apply(lambda row: 
                          ((row.new_col + row.science_score) / 2),
                           axis = 1)
df

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,1.537251,0.130402,-0.530160,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-02,0.171466,0.600683,0.692790,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,-0.686669,0.515593,0.232791,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,0.501356,-1.317384,0.538449,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,1.803684,-1.110519,-0.171500,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,-2.560076,-0.501009,1.272388,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [230]:
df.drop(['A', 'B'], axis = 1) # axis works for columns / index = 0 , column = 1

,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,-0.530160,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-02,0.692790,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,0.232791,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,0.538449,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,-0.171500,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,1.272388,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [236]:
df.drop(['20130101','20130104'], axis=0) # axis works for columns / index = 0 , column = 1

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-02,0.171466,0.600683,0.692790,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,-0.686669,0.515593,0.232791,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-05,1.803684,-1.110519,-0.171500,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,-2.560076,-0.501009,1.272388,-5,-5.0,NaN,34.0,25.0,39.0,29.50